brew 'cask'

tap 'caskroom/cask'
tap 'caskroom/versions'

# GNU utilities
brew 'coreutils'
brew 'moreutils'
brew 'findutils'
brew 'gnu-sed', args: ['with-default-names']

# OS updates
brew 'vim', args: ['override-system-vi']
brew 'wget', args: ['with-iri']
brew 'grep'
brew 'openssh'
brew 'screen'

# Shells
brew 'bash'
brew 'fish'

# Git
brew 'git'
brew 'git-lfs'
brew 'git-sizer'
brew 'hub'

# Java
brew 'java'
brew 'java8'
brew 'jenv'
brew 'maven'

# Ruby
brew 'rbenv'
brew 'rbenv-bundler'
brew 'ruby-build'

# Storage
brew 'elasticsearch@2.4'
brew 'postgresql@9.5'
brew 'redis'
brew 'sqlite'

# Media
brew 'exif'
brew 'exiftool'
brew 'ffmpeg'
brew 'homebrew/x11/feh'
brew 'imagemagick', args: ['with-x11']
brew 'mplayer'
brew 'mkvtoolnix'

# Utilities
brew 'ack'
brew 'asciinema'
brew 'cmake'
brew 'htop-osx'
brew 'mc'
brew 'ncdu'
brew 'nmap'
brew 'p7zip'
brew 'rename'
brew 'telnet'
brew 'tree'
brew 'unrar'
brew 'xz'

# Applications

cask_args appdir: '/Applications'

cask 'atom'
cask 'dia'
cask 'eclipse-installer'
cask 'google-chrome'
cask 'github'
cask 'iterm2'
cask 'pgadmin3'
cask 'rubymine'
cask 'slack'
cask 'spectacle'
cask 'transmission'
