tap 'homebrew/versions'
tap 'homebrew/x11'

# GNU utilities
brew 'coreutils'
brew 'moreutils'
brew 'findutils'
brew 'gnu-sed', args: ['with-default-names']

# OS X tool updates
brew 'vim', args: ['override-system-vi']
brew 'wget', args: ['with-iri']
brew 'homebrew/dupes/grep'
brew 'homebrew/dupes/openssh'
brew 'homebrew/dupes/screen'

# Shells
brew 'bash'
brew 'fish'

# Git
brew 'git'
brew 'git-lfs'
brew 'hub'

# Java
brew 'jenv'
brew 'maven'

# Ruby
brew 'rbenv'
brew 'rbenv-bundler'
brew 'ruby-build'

# Storage
brew 'elasticsearch'
brew 'postgres'
brew 'redis'
brew 'sqlite'

# Utilities
brew 'ack'
brew 'cmake'
brew 'htop-osx'
brew 'mc'
brew 'ncdu'
brew 'nmap'
brew 'p7zip'
brew 'rename'
brew 'tree'
brew 'unrar'
brew 'xz'

# Media
brew 'exif'
brew 'exiftool'
brew 'ffmpeg'
brew 'imagemagick', args: ['with-x11']
brew 'mplayer'
brew 'homebrew/x11/feh'

tap 'caskroom/cask'
tap 'caskroom/fonts'

# Applications
cask 'dia'
cask 'diashapes'
cask 'pgadmin4'

# Fonts
cask 'font-fontawesome'
cask 'font-octicons'
cask 'font-open-sans'
cask 'font-open-sans-condensed'

# TODO consider
# google-chrome
# atom, rubymine
# Caskroom/cask/java
# Caskroom/cask/eclipse-platform
